{"name":"PurePrismTxt","description":"A .txt extension note taking app made with electron and vite","url":"https://github.com/xushidev/PurePrismTxt","readme":"<div align=\"center\">\n    <img src=\"./resources/icon.png\" width=\"300\" alt=\"PurePrism Icon\">\n</div>\n\n## PurePrismTxt - 📓 A minimal focused note taking application\n\nPurePrism (you can omit the txt part) is a minimalistic note taking application written with JavaScript inspired by [Obsidian](https://obsidian.md/). It aims to provide a calm and productivity focused experience to it's users by removing most of the configurations and only relying on `.txt` files.\n\n## Project status\n\nPublic pre-alpha, it is recommended to wait for newer releases before using the app due to lack of intended features, if you are still using the app, it is expected to break.\n\nPurePrism is still under heavy development, hence all feedbacks are welcome. As more features will appear in future.\n\n## Installation\n\n### Compiled app:\n\nIf you wish to install the already built app, you can simply go to the [release page](https://github.com/xushidev/PurePrismTxt/releases), download the latest setup and install it directly.\n\n### Building Locally:\n\nIf you wish to build the app locally, you can follow those simple steps:\n\n```bash\n# Clone the repository to your local machine\n$ git clone https://github.com/xushidev/PurePrismTxt.git\n$ cd PurePrismTxt\n\n# Install the required depencies\n$ npm install\n```\n\nAnd depending on your machine, you can run one of those commands:\n\n```bash\n# For windows\n$ npm run build:win\n\n# For macOS\n$ npm run build:mac\n\n# For Linux\n$ npm run build:linux\n```\n\n## To-do list:\n\n- [ ] Adding a button or a feature to add files and folders to the selected root directory.\n\n- [ ] Adding a built-in to-do list to the app + calendar.\n\n- [ ] Considering rewriting the app with a Rust + Tauri release.\n\n- [ ] Adding an usage documentation and a preview video to the app.\n","_id":1025739464}